askn37/multix-zinnia-sdk-megaAVR/boards.txt
menu.01_variant=Variant
menu.02_clock=Clock
menu.11_BODMODE=BOD Mode
menu.12_BODLVL=BOD Level
menu.21_resetpin=FUSE PF6
menu.22_updipin=FUSE UPDI
menu.23_eeprom=FUSE EEPROM
menu.51_buildopt=Build Option
menu.52_macroapi=Build API
menu.53_printf=Build "printf"
menu.54_console_select=Console and LED
menu.90_console_baud=Console
menu.95_bootloader=Bootloader


megaAVR0.name=megaAVR-0 with Bootloader
megaAVR0.build.board=AVR_ATMEGA4809
megaAVR0.build.core=megaAVR
tinyAVR012.name=tinyAVR-0/1/2 with Bootloader
tinyAVR012.build.board=AVR_ATTINY1617
tinyAVR012.build.core=megaAVR
tinyAVR01.name=tinyAVR-0/1 8pin with Bootloader
tinyAVR01.build.board=AVR_ATTINY412
tinyAVR01.build.core=megaAVR
separator.name=-
separator.build.board=-
megaAVR0_noloader.name=megaAVR-0 w/o Bootloader
megaAVR0_noloader.build.board=AVR_ATMEGA4809
megaAVR0_noloader.build.core=megaAVR
tinyAVR012_noloader.name=tinyAVR-0/1/2 w/o Bootloader
tinyAVR012_noloader.build.board=AVR_ATTINY1617
tinyAVR012_noloader.build.core=megaAVR


megaAVR0.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
megaAVR0.bootloader.BOOTSIZE=0x02
megaAVR0.bootloader.CODESIZE=0x00
megaAVR0.bootloader.OSCCFG=0b00000010
megaAVR0.bootloader.SYSCFG0=0b1100{bootloader.reset_bit}0{bootloader.eesave_bit}
megaAVR0.bootloader.SYSCFG1=0b00000111
megaAVR0.bootloader.WDTCFG=0b00000000
megaAVR0.bootloader.bod_lvl=000
megaAVR0.bootloader.bod_mode=00
megaAVR0.bootloader.bod_sample=0
megaAVR0.bootloader.eepupload=
megaAVR0.bootloader.eesave_bit=1
megaAVR0.bootloader.reset_bit=11
megaAVR0.bootloader.tool=avrdude
megaAVR0.bootloader.programed_type=.with_bootloader
megaAVR0.build.export_merged_output=true
megaAVR0.build.text_section_start=.text=0x200
megaAVR0.build.buildopt=-DNDEBUG
megaAVR0.build.console_baud=-DCONSOLE_BAUD=9600
megaAVR0.build.led_pin=-DLED_BUILTIN=PIN_PA7
megaAVR0.build.macroapi=-DENABLE_MACRO_API
megaAVR0.build.printf=
megaAVR0.build.printflt=
megaAVR0.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
megaAVR0.upload.protocol=arduino
megaAVR0.upload.speed=115200
megaAVR0.upload.tool=avrdude
megaAVR0.menu.01_variant.01.build.board=AVR_ATMEGA4809
megaAVR0.menu.01_variant.01.build.mcu=atmega4809
megaAVR0.menu.01_variant.01.build.variant=megaAVR0_48
megaAVR0.menu.01_variant.01.upload.maximum_data_size=6144
megaAVR0.menu.01_variant.01.upload.maximum_size=48640
megaAVR0.menu.01_variant.01=48pin ATmega4809 (48KiB+6KiB)
megaAVR0.menu.01_variant.02.build.board=AVR_ATMEGA3209
megaAVR0.menu.01_variant.02.build.mcu=atmega3209
megaAVR0.menu.01_variant.02.build.variant=megaAVR0_48
megaAVR0.menu.01_variant.02.upload.maximum_data_size=4096
megaAVR0.menu.01_variant.02.upload.maximum_size=32256
megaAVR0.menu.01_variant.02=48pin ATmega3209 (32KiB+4KiB)
megaAVR0.menu.01_variant.03.build.board=AVR_ATMEGA1609
megaAVR0.menu.01_variant.03.build.mcu=atmega1609
megaAVR0.menu.01_variant.03.build.variant=megaAVR0_48
megaAVR0.menu.01_variant.03.upload.maximum_data_size=2048
megaAVR0.menu.01_variant.03.upload.maximum_size=15872
megaAVR0.menu.01_variant.03=48pin ATmega1609 (16KiB+2KiB)
megaAVR0.menu.01_variant.04.build.board=AVR_ATMEGA809
megaAVR0.menu.01_variant.04.build.mcu=atmega809
megaAVR0.menu.01_variant.04.build.variant=megaAVR0_48
megaAVR0.menu.01_variant.04.upload.maximum_data_size=1024
megaAVR0.menu.01_variant.04.upload.maximum_size=7680
megaAVR0.menu.01_variant.04=48pin ATmega809 (8KiB+1KiB)
megaAVR0.menu.01_variant.10=-
megaAVR0.menu.01_variant.11.build.board=AVR_ATMEGA4809
megaAVR0.menu.01_variant.11.build.mcu=atmega4809
megaAVR0.menu.01_variant.11.build.variant=megaAVR0_40
megaAVR0.menu.01_variant.11.upload.maximum_data_size=6144
megaAVR0.menu.01_variant.11.upload.maximum_size=48640
megaAVR0.menu.01_variant.11=40pin ATmega4809 (48KiB+6KiB)
megaAVR0.menu.01_variant.20=-
megaAVR0.menu.01_variant.21.build.board=AVR_ATMEGA4808
megaAVR0.menu.01_variant.21.build.mcu=atmega4808
megaAVR0.menu.01_variant.21.build.variant=megaAVR0_32
megaAVR0.menu.01_variant.21.upload.maximum_data_size=6144
megaAVR0.menu.01_variant.21.upload.maximum_size=48640
megaAVR0.menu.01_variant.21=32pin ATmega4808 (48KiB+6KiB)
megaAVR0.menu.01_variant.22.build.board=AVR_ATMEGA3208
megaAVR0.menu.01_variant.22.build.mcu=atmega3208
megaAVR0.menu.01_variant.22.build.variant=megaAVR0_32
megaAVR0.menu.01_variant.22.upload.maximum_data_size=4096
megaAVR0.menu.01_variant.22.upload.maximum_size=32256
megaAVR0.menu.01_variant.22=32pin ATmega3208 (32KiB+4KiB)
megaAVR0.menu.01_variant.23.build.board=AVR_ATMEGA1608
megaAVR0.menu.01_variant.23.build.mcu=atmega1608
megaAVR0.menu.01_variant.23.build.variant=megaAVR0_32
megaAVR0.menu.01_variant.23.upload.maximum_data_size=2048
megaAVR0.menu.01_variant.23.upload.maximum_size=15872
megaAVR0.menu.01_variant.23=32pin ATmega1608 (16KiB+2KiB)
megaAVR0.menu.01_variant.24.build.board=AVR_ATMEGA808
megaAVR0.menu.01_variant.24.build.mcu=atmega808
megaAVR0.menu.01_variant.24.build.variant=megaAVR0_32
megaAVR0.menu.01_variant.24.upload.maximum_data_size=1024
megaAVR0.menu.01_variant.24.upload.maximum_size=7680
megaAVR0.menu.01_variant.24=32pin ATmega808 (8KiB+1KiB)
megaAVR0.menu.01_variant.30=-
megaAVR0.menu.01_variant.31.build.board=AVR_ATMEGA4808
megaAVR0.menu.01_variant.31.build.mcu=atmega4808
megaAVR0.menu.01_variant.31.build.variant=megaAVR0_28
megaAVR0.menu.01_variant.31.upload.maximum_data_size=6144
megaAVR0.menu.01_variant.31.upload.maximum_size=48640
megaAVR0.menu.01_variant.31=28pin ATmega4808 (48KiB+6KiB)
megaAVR0.menu.01_variant.32.build.board=AVR_ATMEGA3208
megaAVR0.menu.01_variant.32.build.mcu=atmega3208
megaAVR0.menu.01_variant.32.build.variant=megaAVR0_28
megaAVR0.menu.01_variant.32.upload.maximum_data_size=4096
megaAVR0.menu.01_variant.32.upload.maximum_size=32256
megaAVR0.menu.01_variant.32=28pin ATmega3208 (32KiB+4KiB)
megaAVR0.menu.01_variant.33.build.board=AVR_ATMEGA1608
megaAVR0.menu.01_variant.33.build.mcu=atmega1608
megaAVR0.menu.01_variant.33.build.variant=megaAVR0_28
megaAVR0.menu.01_variant.33.upload.maximum_data_size=2048
megaAVR0.menu.01_variant.33.upload.maximum_size=15872
megaAVR0.menu.01_variant.33=28pin ATmega1608 (16KiB+2KiB)
megaAVR0.menu.01_variant.34.build.board=AVR_ATMEGA808
megaAVR0.menu.01_variant.34.build.mcu=atmega808
megaAVR0.menu.01_variant.34.build.variant=megaAVR0_28
megaAVR0.menu.01_variant.34.upload.maximum_data_size=1024
megaAVR0.menu.01_variant.34.upload.maximum_size=7680
megaAVR0.menu.01_variant.34=28pin ATmega808 (8KiB+1KiB)
megaAVR0.menu.02_clock.01.bootloader.bod_sample=0
megaAVR0.menu.02_clock.01.build.f_cpu=20000000L
megaAVR0.menu.02_clock.01=Internal 20 MHz
megaAVR0.menu.02_clock.02.bootloader.bod_sample=0
megaAVR0.menu.02_clock.02.build.f_cpu=10000000L
megaAVR0.menu.02_clock.02=Internal 10 MHz
megaAVR0.menu.02_clock.03.bootloader.bod_sample=0
megaAVR0.menu.02_clock.03.build.f_cpu=5000000L
megaAVR0.menu.02_clock.03=Internal 5 MHz
megaAVR0.menu.02_clock.10=-
megaAVR0.menu.02_clock.11.bootloader.OSCCFG=0b00000001
megaAVR0.menu.02_clock.11.bootloader.bod_sample=0
megaAVR0.menu.02_clock.11.build.f_cpu=16000000L
megaAVR0.menu.02_clock.11=Internal 16 MHz
megaAVR0.menu.02_clock.12.bootloader.OSCCFG=0b00000001
megaAVR0.menu.02_clock.12.bootloader.bod_sample=0
megaAVR0.menu.02_clock.12.build.f_cpu=8000000L
megaAVR0.menu.02_clock.12=Internal 8 MHz
megaAVR0.menu.02_clock.13.bootloader.OSCCFG=0b00000001
megaAVR0.menu.02_clock.13.bootloader.bod_sample=0
megaAVR0.menu.02_clock.13.build.f_cpu=4000000L
megaAVR0.menu.02_clock.13=Internal 4 MHz
megaAVR0.menu.02_clock.15.bootloader.OSCCFG=0b00000001
megaAVR0.menu.02_clock.15.bootloader.bod_sample=0
megaAVR0.menu.02_clock.15.build.f_cpu=1000000L
megaAVR0.menu.02_clock.15=Internal 1 MHz
megaAVR0.menu.02_clock.20=-
megaAVR0.menu.02_clock.21.bootloader.bod_sample=0
megaAVR0.menu.02_clock.21.build.f_cpu=2000000L
megaAVR0.menu.02_clock.21=Internal 2 MHz
megaAVR0.menu.02_clock.22.bootloader.bod_sample=1
megaAVR0.menu.02_clock.22.build.f_cpu=32768
megaAVR0.menu.02_clock.22=Internal 32.768 kHz (ULP)
megaAVR0.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
megaAVR0.menu.11_BODMODE.01_disabled=BOD Disabled
megaAVR0.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
megaAVR0.menu.11_BODMODE.02_enabled=BOD Enabled
megaAVR0.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
megaAVR0.menu.11_BODMODE.03_sampled=BOD Sampled
megaAVR0.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
megaAVR0.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
megaAVR0.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
megaAVR0.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
megaAVR0.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
megaAVR0.menu.12_BODLVL.BODLEVEL2=Level 2.6V
megaAVR0.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
megaAVR0.menu.12_BODLVL.BODLEVEL7=Level 4.3V
megaAVR0.menu.21_resetpin.01_reset.bootloader.reset_bit=11
megaAVR0.menu.21_resetpin.01_reset=PF6 pin=Reset
megaAVR0.menu.21_resetpin.02_gpio.bootloader.reset_bit=01
megaAVR0.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
megaAVR0.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
megaAVR0.menu.23_eeprom.01_keep=Save guard "Retained"
megaAVR0.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
megaAVR0.menu.23_eeprom.02_erase=Save guard "Erase"
megaAVR0.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
megaAVR0.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
megaAVR0.menu.23_eeprom.03_replace="Erase" and "Replace"
megaAVR0.menu.51_buildopt.01_Release=Build Release (default)
megaAVR0.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
megaAVR0.menu.51_buildopt.02_Debug1=Build DEBUG=1
megaAVR0.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
megaAVR0.menu.51_buildopt.03_Debug2=Build DEBUG=2
megaAVR0.menu.52_macroapi.01_Enable=Macro API Enable (default)
megaAVR0.menu.52_macroapi.02_Disable.build.macroapi=
megaAVR0.menu.52_macroapi.02_Disable=Macro API Disable
megaAVR0.menu.52_macroapi.03_AllDisable.build.macroapi=
megaAVR0.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
megaAVR0.menu.52_macroapi.03_AllDisable=Standard Library All Disable
megaAVR0.menu.53_printf.01_default=default
megaAVR0.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
megaAVR0.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
megaAVR0.menu.53_printf.02_full=Float Support
megaAVR0.menu.90_console_baud.01.build.console_baud=-DCONSOLE_BAUD=9600
megaAVR0.menu.90_console_baud.01=CONSOLE_BAUD=9600 bps (default)
megaAVR0.menu.90_console_baud.03.build.console_baud=-DCONSOLE_BAUD=38400
megaAVR0.menu.90_console_baud.03=CONSOLE_BAUD=38400 bps
megaAVR0.menu.90_console_baud.04.build.console_baud=-DCONSOLE_BAUD=57600
megaAVR0.menu.90_console_baud.04=CONSOLE_BAUD=57600 bps
megaAVR0.menu.90_console_baud.05.build.console_baud=-DCONSOLE_BAUD=115200
megaAVR0.menu.90_console_baud.05=CONSOLE_BAUD=115200 bps
megaAVR0.menu.90_console_baud.06.build.console_baud=-DCONSOLE_BAUD=230400
megaAVR0.menu.90_console_baud.06=CONSOLE_BAUD=230400 bps
megaAVR0.menu.90_console_baud.15.build.console_baud=-DCONSOLE_BAUD=1000000
megaAVR0.menu.90_console_baud.15=CONSOLE_BAUD=1000000 bps
megaAVR0.menu.90_console_baud.20=-
megaAVR0.menu.90_console_baud.21.build.console_baud=-DCONSOLE_BAUD=2400
megaAVR0.menu.90_console_baud.21=CONSOLE_BAUD=2400 bps (for ULP)
megaAVR0.menu.95_bootloader.01.bootloader.file=hex/boot_atmega_UART0_A0_{upload.speed}_LA7.hex
megaAVR0.menu.95_bootloader.01.build.console_select=-DSerial=Serial0
megaAVR0.menu.95_bootloader.01=UART0 TX:PA0 RX:PA1 LED=PA7 (default)
megaAVR0.menu.95_bootloader.02.bootloader.file=hex/boot_atmega_UART1_C0_{upload.speed}_LA7.hex
megaAVR0.menu.95_bootloader.02.build.console_select=-DSerial=Serial1
megaAVR0.menu.95_bootloader.02=UART1 TX:PC0 RX:PC1 LED=PA7
megaAVR0.menu.95_bootloader.03.bootloader.file=hex/boot_atmega_UART2_F0_{upload.speed}_LA7.hex
megaAVR0.menu.95_bootloader.03.build.console_select=-DSerial=Serial2
megaAVR0.menu.95_bootloader.03=UART2 TX:PF0 RX:PF1 LED=PA7
megaAVR0.menu.95_bootloader.10=-
megaAVR0.menu.95_bootloader.11.bootloader.file=hex/boot_atmega_UART3_B0_{upload.speed}_LA7.hex
megaAVR0.menu.95_bootloader.11.build.console_select=-DSerial=Serial3
megaAVR0.menu.95_bootloader.11=UART3 TX:PB0 RX:PB1 LED=PA7 (48pin only)
megaAVR0.menu.95_bootloader.12.bootloader.file=hex/boot_atmega_UART2_F4_{upload.speed}_LA7.hex
megaAVR0.menu.95_bootloader.12.build.console_select=-DSerial=Serial2
megaAVR0.menu.95_bootloader.12=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48pin only)


