askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
tinyAVR012.bootloader.BOOTSIZE=0x02
tinyAVR012.bootloader.CODESIZE=0x00
tinyAVR012.bootloader.OSCCFG=0b00000010
tinyAVR012.bootloader.SYSCFG0=0b1100{bootloader.reset_bit}0{bootloader.eesave_bit}
tinyAVR012.bootloader.SYSCFG1=0b00000111
tinyAVR012.bootloader.WDTCFG=0b00000000
tinyAVR012.bootloader.bod_lvl=000
tinyAVR012.bootloader.bod_mode=00
tinyAVR012.bootloader.bod_sample=0
tinyAVR012.bootloader.eepupload=
tinyAVR012.bootloader.eesave_bit=1
tinyAVR012.bootloader.reset_bit=10
tinyAVR012.bootloader.tool=avrdude
tinyAVR012.bootloader.programed_type=.with_bootloader
tinyAVR012.build.export_merged_output=true
tinyAVR012.build.text_section_start=.text=0x200
tinyAVR012.build.buildopt=-DNDEBUG
tinyAVR012.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012.build.macroapi=-DENABLE_MACRO_API
tinyAVR012.build.printf=
tinyAVR012.build.printflt=
tinyAVR012.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
tinyAVR012.upload.protocol=arduino
tinyAVR012.upload.speed=115200
tinyAVR012.upload.tool=avrdude
tinyAVR012.menu.01_variant.01.build.board=AVR_ATTINY3227
tinyAVR012.menu.01_variant.01.build.mcu=attiny3227
tinyAVR012.menu.01_variant.01.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.01.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012.menu.01_variant.01.upload.maximum_data_size=3072
tinyAVR012.menu.01_variant.01.upload.maximum_size=32768
tinyAVR012.menu.01_variant.01=tinyAVR-2 24pin ATtiny3227 (32KiB+3KiB)
tinyAVR012.menu.01_variant.02.build.board=AVR_ATTINY1627
tinyAVR012.menu.01_variant.02.build.mcu=attiny1627
tinyAVR012.menu.01_variant.02.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.02.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.02.upload.maximum_size=15872
tinyAVR012.menu.01_variant.02=tinyAVR-2 24pin ATtiny1627 (16KiB+2KiB)
tinyAVR012.menu.01_variant.03.build.board=AVR_ATTINY827
tinyAVR012.menu.01_variant.03.build.mcu=attiny827
tinyAVR012.menu.01_variant.03.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.03.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.03.upload.maximum_size=7680
tinyAVR012.menu.01_variant.03=tinyAVR-2 24pin ATtiny827 (8KiB+1KiB)
tinyAVR012.menu.01_variant.04.build.board=AVR_ATTINY427
tinyAVR012.menu.01_variant.04.build.mcu=attiny427
tinyAVR012.menu.01_variant.04.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.04.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.04.upload.maximum_size=3584
tinyAVR012.menu.01_variant.04=tinyAVR-2 24pin ATtiny427 (4KiB+512B)
tinyAVR012.menu.01_variant.10=-
tinyAVR012.menu.01_variant.11.build.board=AVR_ATTINY3226
tinyAVR012.menu.01_variant.11.build.mcu=attiny3226
tinyAVR012.menu.01_variant.11.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.11.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012.menu.01_variant.11.upload.maximum_data_size=3072
tinyAVR012.menu.01_variant.11.upload.maximum_size=32768
tinyAVR012.menu.01_variant.11=tinyAVR-2 20pin ATtiny3226 (32KiB+3KiB)
tinyAVR012.menu.01_variant.12.build.board=AVR_ATTINY1626
tinyAVR012.menu.01_variant.12.build.mcu=attiny1626
tinyAVR012.menu.01_variant.12.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.12.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.12.upload.maximum_size=15872
tinyAVR012.menu.01_variant.12=tinyAVR-2 20pin ATtiny1626 (16KiB+2KiB)
tinyAVR012.menu.01_variant.13.build.board=AVR_ATTINY826
tinyAVR012.menu.01_variant.13.build.mcu=attiny826
tinyAVR012.menu.01_variant.13.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.13.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.13.upload.maximum_size=7680
tinyAVR012.menu.01_variant.13=tinyAVR-2 20pin ATtiny826 (8KiB+1KiB)
tinyAVR012.menu.01_variant.14.build.board=AVR_ATTINY426
tinyAVR012.menu.01_variant.14.build.mcu=attiny426
tinyAVR012.menu.01_variant.14.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.14.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.14.upload.maximum_size=3584
tinyAVR012.menu.01_variant.14=tinyAVR-2 20pin ATtiny426 (4KiB+512B)
tinyAVR012.menu.01_variant.20=-
tinyAVR012.menu.01_variant.21.build.board=AVR_ATTINY3224
tinyAVR012.menu.01_variant.21.build.mcu=attiny3224
tinyAVR012.menu.01_variant.21.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.21.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012.menu.01_variant.21.upload.maximum_data_size=3072
tinyAVR012.menu.01_variant.21.upload.maximum_size=32768
tinyAVR012.menu.01_variant.21=tinyAVR-2 14pin ATtiny3224 (32KiB+3KiB)
tinyAVR012.menu.01_variant.22.build.board=AVR_ATTINY1624
tinyAVR012.menu.01_variant.22.build.mcu=attiny1624
tinyAVR012.menu.01_variant.22.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.22.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.22.upload.maximum_size=15872
tinyAVR012.menu.01_variant.22=tinyAVR-2 14pin ATtiny1624 (16KiB+2KiB)
tinyAVR012.menu.01_variant.23.build.board=AVR_ATTINY824
tinyAVR012.menu.01_variant.23.build.mcu=attiny824
tinyAVR012.menu.01_variant.23.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.23.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.23.upload.maximum_size=7680
tinyAVR012.menu.01_variant.23=tinyAVR-2 14pin ATtiny824 (8KiB+1KiB)
tinyAVR012.menu.01_variant.24.build.board=AVR_ATTINY424
tinyAVR012.menu.01_variant.24.build.mcu=attiny424
tinyAVR012.menu.01_variant.24.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.24.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.24.upload.maximum_size=3584
tinyAVR012.menu.01_variant.24=tinyAVR-2 14pin ATtiny424 (4KiB+512B)
tinyAVR012.menu.01_variant.30=-
tinyAVR012.menu.01_variant.31.build.board=AVR_ATTINY3217
tinyAVR012.menu.01_variant.31.build.mcu=attiny3217
tinyAVR012.menu.01_variant.31.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.31.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012.menu.01_variant.31.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.31.upload.maximum_size=32768
tinyAVR012.menu.01_variant.31=tinyAVR-1 24pin ATtiny3217 (32KiB+2KiB)
tinyAVR012.menu.01_variant.32.build.board=AVR_ATTINY1617
tinyAVR012.menu.01_variant.32.build.mcu=attiny1617
tinyAVR012.menu.01_variant.32.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.32.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.32.upload.maximum_size=15872
tinyAVR012.menu.01_variant.32=tinyAVR-1 24pin ATtiny1617 (16KiB+2KiB)
tinyAVR012.menu.01_variant.33.build.board=AVR_ATTINY817
tinyAVR012.menu.01_variant.33.build.mcu=attiny817
tinyAVR012.menu.01_variant.33.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.33.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.33.upload.maximum_size=7680
tinyAVR012.menu.01_variant.33=tinyAVR-1 24pin ATtiny817 (8KiB+512B)
tinyAVR012.menu.01_variant.34.build.board=AVR_ATTINY417
tinyAVR012.menu.01_variant.34.build.mcu=attiny417
tinyAVR012.menu.01_variant.34.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.34.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.34.upload.maximum_size=3584
tinyAVR012.menu.01_variant.34=tinyAVR-1 24pin ATtiny417 (4KiB+256B)
tinyAVR012.menu.01_variant.40=-
tinyAVR012.menu.01_variant.41.build.board=AVR_ATTINY3216
tinyAVR012.menu.01_variant.41.build.mcu=attiny3216
tinyAVR012.menu.01_variant.41.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.41.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012.menu.01_variant.41.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.41.upload.maximum_size=32768
tinyAVR012.menu.01_variant.41=tinyAVR-1 20pin ATtiny3216 (32KiB+2KiB)
tinyAVR012.menu.01_variant.42.build.board=AVR_ATTINY1616
tinyAVR012.menu.01_variant.42.build.mcu=attiny1616
tinyAVR012.menu.01_variant.42.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.42.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.42.upload.maximum_size=15872
tinyAVR012.menu.01_variant.42=tinyAVR-1 20pin ATtiny1616 (16KiB+2KiB)
tinyAVR012.menu.01_variant.43.build.board=AVR_ATTINY816
tinyAVR012.menu.01_variant.43.build.mcu=attiny816
tinyAVR012.menu.01_variant.43.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.43.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.43.upload.maximum_size=7680
tinyAVR012.menu.01_variant.43=tinyAVR-1 20pin ATtiny816 (8KiB+512B)
tinyAVR012.menu.01_variant.44.build.board=AVR_ATTINY416
tinyAVR012.menu.01_variant.44.build.mcu=attiny416
tinyAVR012.menu.01_variant.44.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.44.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.44.upload.maximum_size=3584
tinyAVR012.menu.01_variant.44=tinyAVR-1 20pin ATtiny416 (4KiB+256B)
tinyAVR012.menu.01_variant.50=-
tinyAVR012.menu.01_variant.51.build.board=AVR_ATTINY1614
tinyAVR012.menu.01_variant.51.build.mcu=attiny1614
tinyAVR012.menu.01_variant.51.build.variant=tinyAVR1_14
tinyAVR012.menu.01_variant.51.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.51.upload.maximum_size=15872
tinyAVR012.menu.01_variant.51=tinyAVR-1 14pin ATtiny1614 (16KiB+2KiB)
tinyAVR012.menu.01_variant.52.build.board=AVR_ATTINY814
tinyAVR012.menu.01_variant.52.build.mcu=attiny814
tinyAVR012.menu.01_variant.52.build.variant=tinyAVR1_14
tinyAVR012.menu.01_variant.52.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.52.upload.maximum_size=7680
tinyAVR012.menu.01_variant.52=tinyAVR-1 14pin ATtiny814 (8KiB+512B)
tinyAVR012.menu.01_variant.53.build.board=AVR_ATTINY414
tinyAVR012.menu.01_variant.53.build.mcu=attiny414
tinyAVR012.menu.01_variant.53.build.variant=tinyAVR1_14
tinyAVR012.menu.01_variant.53.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.53.upload.maximum_size=3584
tinyAVR012.menu.01_variant.53=tinyAVR-1 14pin ATtiny414 (4KiB+256B)
tinyAVR012.menu.01_variant.70=-
tinyAVR012.menu.01_variant.71.build.board=AVR_ATTINY1607
tinyAVR012.menu.01_variant.71.build.mcu=attiny1607
tinyAVR012.menu.01_variant.71.build.variant=tinyAVR0_24
tinyAVR012.menu.01_variant.71.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.71.upload.maximum_size=15872
tinyAVR012.menu.01_variant.71=tinyAVR-0 24pin ATtiny1607 (16KiB+1KiB)
tinyAVR012.menu.01_variant.72.build.board=AVR_ATTINY807
tinyAVR012.menu.01_variant.72.build.mcu=attiny807
tinyAVR012.menu.01_variant.72.build.variant=tinyAVR0_24
tinyAVR012.menu.01_variant.72.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.72.upload.maximum_size=7680
tinyAVR012.menu.01_variant.72=tinyAVR-0 24pin ATtiny807 (8KiB+512B)
tinyAVR012.menu.01_variant.80=-
tinyAVR012.menu.01_variant.81.build.board=AVR_ATTINY1606
tinyAVR012.menu.01_variant.81.build.mcu=attiny1606
tinyAVR012.menu.01_variant.81.build.variant=tinyAVR0_20
tinyAVR012.menu.01_variant.81.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.81.upload.maximum_size=15872
tinyAVR012.menu.01_variant.81=tinyAVR-0 20pin ATtiny1606 (16KiB+1KiB)
tinyAVR012.menu.01_variant.82.build.board=AVR_ATTINY806
tinyAVR012.menu.01_variant.82.build.mcu=attiny806
tinyAVR012.menu.01_variant.82.build.variant=tinyAVR0_20
tinyAVR012.menu.01_variant.82.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.82.upload.maximum_size=7680
tinyAVR012.menu.01_variant.82=tinyAVR-0 20pin ATtiny806 (8KiB+512B)
tinyAVR012.menu.01_variant.83.build.board=AVR_ATTINY406
tinyAVR012.menu.01_variant.83.build.mcu=attiny406
tinyAVR012.menu.01_variant.83.build.variant=tinyAVR0_20
tinyAVR012.menu.01_variant.83.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.83.upload.maximum_size=3584
tinyAVR012.menu.01_variant.83=tinyAVR-0 20pin ATtiny406 (4KiB+256B)
tinyAVR012.menu.01_variant.90=-
tinyAVR012.menu.01_variant.91.build.board=AVR_ATTINY1604
tinyAVR012.menu.01_variant.91.build.mcu=attiny1604
tinyAVR012.menu.01_variant.91.build.variant=tinyAVR0_14
tinyAVR012.menu.01_variant.91.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.91.upload.maximum_size=15872
tinyAVR012.menu.01_variant.91=tinyAVR-0 14pin ATtiny1604 (16KiB+1KiB)
tinyAVR012.menu.01_variant.92.build.board=AVR_ATTINY804
tinyAVR012.menu.01_variant.92.build.mcu=attiny804
tinyAVR012.menu.01_variant.92.build.variant=tinyAVR0_14
tinyAVR012.menu.01_variant.92.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.92.upload.maximum_size=7680
tinyAVR012.menu.01_variant.92=tinyAVR-0 14pin ATtiny804 (8KiB+512B)
tinyAVR012.menu.01_variant.93.build.board=AVR_ATTINY404
tinyAVR012.menu.01_variant.93.build.mcu=attiny404
tinyAVR012.menu.01_variant.93.build.variant=tinyAVR0_14
tinyAVR012.menu.01_variant.93.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.93.upload.maximum_size=3584
tinyAVR012.menu.01_variant.93=tinyAVR-0 14pin ATtiny404 (4KiB+256B)
tinyAVR012.menu.02_clock.01.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.01.build.f_cpu=20000000L
tinyAVR012.menu.02_clock.01=Internal 20 MHz
tinyAVR012.menu.02_clock.02.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.02.build.f_cpu=10000000L
tinyAVR012.menu.02_clock.02=Internal 10 MHz
tinyAVR012.menu.02_clock.03.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.03.build.f_cpu=5000000L
tinyAVR012.menu.02_clock.03=Internal 5 MHz
tinyAVR012.menu.02_clock.10=-
tinyAVR012.menu.02_clock.11.bootloader.OSCCFG=0b00000001
tinyAVR012.menu.02_clock.11.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.11.build.f_cpu=16000000L
tinyAVR012.menu.02_clock.11=Internal 16 MHz
tinyAVR012.menu.02_clock.12.bootloader.OSCCFG=0b00000001
tinyAVR012.menu.02_clock.12.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.12.build.f_cpu=8000000L
tinyAVR012.menu.02_clock.12=Internal 8 MHz
tinyAVR012.menu.02_clock.13.bootloader.OSCCFG=0b00000001
tinyAVR012.menu.02_clock.13.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.13.build.f_cpu=4000000L
tinyAVR012.menu.02_clock.13=Internal 4 MHz
tinyAVR012.menu.02_clock.15.bootloader.OSCCFG=0b00000001
tinyAVR012.menu.02_clock.15.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.15.build.f_cpu=1000000L
tinyAVR012.menu.02_clock.15=Internal 1 MHz
tinyAVR012.menu.02_clock.20=-
tinyAVR012.menu.02_clock.21.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.21.build.f_cpu=2000000L
tinyAVR012.menu.02_clock.21=Internal 2 MHz
tinyAVR012.menu.02_clock.22.bootloader.bod_sample=1
tinyAVR012.menu.02_clock.22.build.f_cpu=32768
tinyAVR012.menu.02_clock.22=Internal 32.768 kHz (ULP)
tinyAVR012.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
tinyAVR012.menu.11_BODMODE.01_disabled=BOD Disabled
tinyAVR012.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
tinyAVR012.menu.11_BODMODE.02_enabled=BOD Enabled
tinyAVR012.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
tinyAVR012.menu.11_BODMODE.03_sampled=BOD Sampled
tinyAVR012.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
tinyAVR012.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
tinyAVR012.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
tinyAVR012.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
tinyAVR012.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
tinyAVR012.menu.12_BODLVL.BODLEVEL2=Level 2.6V
tinyAVR012.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
tinyAVR012.menu.12_BODLVL.BODLEVEL7=Level 4.3V
tinyAVR012.menu.22_updipin.01_updi.bootloader.reset_bit=01
tinyAVR012.menu.22_updipin.01_updi=PA0 pin=UPDI (default)
tinyAVR012.menu.22_updipin.02_resetalt.bootloader.reset_bit=11
tinyAVR012.menu.22_updipin.02_resetalt=PA0 pin=UPDI and PB4 pin=RESET (tinyAVR-2 20/24pin only)
tinyAVR012.menu.22_updipin.10=-
tinyAVR012.menu.22_updipin.11_reset.bootloader.reset_bit=10
tinyAVR012.menu.22_updipin.11_reset=PA0 pin=Reset (DANGER:NOT RECOMMENDED)
tinyAVR012.menu.22_updipin.12_gpio.bootloader.reset_bit=00
tinyAVR012.menu.22_updipin.12_gpio=PA0 pin=GPIO (DANGER:NOT RECOMMENDED)
tinyAVR012.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
tinyAVR012.menu.23_eeprom.01_keep=Save guard "Retained"
tinyAVR012.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
tinyAVR012.menu.23_eeprom.02_erase=Save guard "Erase"
tinyAVR012.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
tinyAVR012.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
tinyAVR012.menu.23_eeprom.03_replace="Erase" and "Replace"
tinyAVR012.menu.51_buildopt.01_Release=Build Release (default)
tinyAVR012.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
tinyAVR012.menu.51_buildopt.02_Debug1=Build DEBUG=1
tinyAVR012.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
tinyAVR012.menu.51_buildopt.03_Debug2=Build DEBUG=2
tinyAVR012.menu.52_macroapi.01_Enable=Macro API Enable (default)
tinyAVR012.menu.52_macroapi.02_Disable.build.macroapi=
tinyAVR012.menu.52_macroapi.02_Disable=Macro API Disable
tinyAVR012.menu.52_macroapi.03_AllDisable.build.macroapi=
tinyAVR012.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
tinyAVR012.menu.52_macroapi.03_AllDisable=Standard Library All Disable
tinyAVR012.menu.53_printf.01_default=default
tinyAVR012.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
tinyAVR012.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
tinyAVR012.menu.53_printf.02_full=Float Support
tinyAVR012.menu.90_console_baud.01.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012.menu.90_console_baud.01=CONSOLE_BAUD=9600 bps (default)
tinyAVR012.menu.90_console_baud.03.build.console_baud=-DCONSOLE_BAUD=38400
tinyAVR012.menu.90_console_baud.03=CONSOLE_BAUD=38400 bps
tinyAVR012.menu.90_console_baud.04.build.console_baud=-DCONSOLE_BAUD=57600
tinyAVR012.menu.90_console_baud.04=CONSOLE_BAUD=57600 bps
tinyAVR012.menu.90_console_baud.05.build.console_baud=-DCONSOLE_BAUD=115200
tinyAVR012.menu.90_console_baud.05=CONSOLE_BAUD=115200 bps
tinyAVR012.menu.90_console_baud.06.build.console_baud=-DCONSOLE_BAUD=230400
tinyAVR012.menu.90_console_baud.06=CONSOLE_BAUD=230400 bps
tinyAVR012.menu.90_console_baud.15.build.console_baud=-DCONSOLE_BAUD=1000000
tinyAVR012.menu.90_console_baud.15=CONSOLE_BAUD=1000000 bps
tinyAVR012.menu.90_console_baud.20=-
tinyAVR012.menu.90_console_baud.21.build.console_baud=-DCONSOLE_BAUD=2400
tinyAVR012.menu.90_console_baud.21=CONSOLE_BAUD=2400 bps (for ULP)
