askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012_noloader.menu.02_clock.15.bootloader.OSCCFG=0b00000001
tinyAVR012_noloader.menu.02_clock.15.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.15.build.f_cpu=1000000L
tinyAVR012_noloader.menu.02_clock.15=Internal 1 MHz
tinyAVR012_noloader.menu.02_clock.20=-
tinyAVR012_noloader.menu.02_clock.21.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.21.build.f_cpu=2000000L
tinyAVR012_noloader.menu.02_clock.21=Internal 2 MHz
tinyAVR012_noloader.menu.02_clock.22.bootloader.bod_sample=1
tinyAVR012_noloader.menu.02_clock.22.build.f_cpu=32768
tinyAVR012_noloader.menu.02_clock.22=Internal 32.768 kHz (ULP)
tinyAVR012_noloader.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
tinyAVR012_noloader.menu.11_BODMODE.01_disabled=BOD Disabled
tinyAVR012_noloader.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
tinyAVR012_noloader.menu.11_BODMODE.02_enabled=BOD Enabled
tinyAVR012_noloader.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
tinyAVR012_noloader.menu.11_BODMODE.03_sampled=BOD Sampled
tinyAVR012_noloader.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
tinyAVR012_noloader.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.6V
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL7=Level 4.3V
tinyAVR012_noloader.menu.22_updipin.01_updi.bootloader.reset_bit=01
tinyAVR012_noloader.menu.22_updipin.01_updi=PA0 pin=UPDI (default)
tinyAVR012_noloader.menu.22_updipin.02_resetalt.bootloader.reset_bit=11
tinyAVR012_noloader.menu.22_updipin.02_resetalt=PA0 pin=UPDI and PB4 pin=RESET (tinyAVR-2 20/24pin only)
tinyAVR012_noloader.menu.22_updipin.10=-
tinyAVR012_noloader.menu.22_updipin.11_reset.bootloader.reset_bit=10
tinyAVR012_noloader.menu.22_updipin.11_reset=PA0 pin=Reset (DANGER:NOT RECOMMENDED)
tinyAVR012_noloader.menu.22_updipin.12_gpio.bootloader.reset_bit=00
tinyAVR012_noloader.menu.22_updipin.12_gpio=PA0 pin=GPIO (DANGER:NOT RECOMMENDED)
tinyAVR012_noloader.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
tinyAVR012_noloader.menu.23_eeprom.01_keep=Save guard "Retained"
tinyAVR012_noloader.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
tinyAVR012_noloader.menu.23_eeprom.02_erase=Save guard "Erase"
tinyAVR012_noloader.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
tinyAVR012_noloader.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
tinyAVR012_noloader.menu.23_eeprom.03_replace="Erase" and "Replace"
tinyAVR012_noloader.menu.51_buildopt.01_Release=Build Release (default)
tinyAVR012_noloader.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
tinyAVR012_noloader.menu.51_buildopt.02_Debug1=Build DEBUG=1
tinyAVR012_noloader.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
tinyAVR012_noloader.menu.51_buildopt.03_Debug2=Build DEBUG=2
tinyAVR012_noloader.menu.52_macroapi.01_Enable=Macro API Enable (default)
tinyAVR012_noloader.menu.52_macroapi.02_Disable.build.macroapi=
tinyAVR012_noloader.menu.52_macroapi.02_Disable=Macro API Disable
tinyAVR012_noloader.menu.52_macroapi.03_AllDisable.build.macroapi=
tinyAVR012_noloader.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
tinyAVR012_noloader.menu.52_macroapi.03_AllDisable=Standard Library All Disable
tinyAVR012_noloader.menu.53_printf.01_default=default
tinyAVR012_noloader.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
tinyAVR012_noloader.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
tinyAVR012_noloader.menu.53_printf.02_full=Float Support
tinyAVR012_noloader.menu.54_console_select.01.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.01.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012_noloader.menu.54_console_select.01=UART0 TX:PB2 RX:PB3 LED=PA7
tinyAVR012_noloader.menu.54_console_select.02.build.console_select=-DSerial=Serial0B
tinyAVR012_noloader.menu.54_console_select.02.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012_noloader.menu.54_console_select.02=UART0 TX:PA1 RX:PA2 LED=PA7 (tinyAVR-0/1)
tinyAVR012_noloader.menu.54_console_select.03.build.console_select=-DSerial=Serial1A
tinyAVR012_noloader.menu.54_console_select.03.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012_noloader.menu.54_console_select.03=UART1 TX:PA1 RX:PA2 LED=PA7 (tinyAVR-2)
tinyAVR012_noloader.menu.54_console_select.10=-
tinyAVR012_noloader.menu.54_console_select.11.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.11.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.54_console_select.11=UART0 TX:PA6 RX:PA7 LED=PA3 (8pin)
tinyAVR012_noloader.menu.54_console_select.12.build.console_select=-DSerial=Serial0B
tinyAVR012_noloader.menu.54_console_select.12.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.54_console_select.12=UART0 TX:PA1 RX:PA2 LED=PA3 (8pin)
tinyAVR012_noloader.menu.54_console_select.20=-
tinyAVR012_noloader.menu.54_console_select.21.build.console_select=-DSerial=Serial0B
tinyAVR012_noloader.menu.54_console_select.21.build.led_pin=-DLED_BUILTIN=PIN_PB5 -DSW_BUILTIN=PIN_PB4
tinyAVR012_noloader.menu.54_console_select.21=UART0 TX:PA1 RX:PA2 LED=PB5 SW=PB4 (ATtiny416 Xplained Nano)
tinyAVR012_noloader.menu.54_console_select.22.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.22.build.led_pin=-DLED_BUILTIN=PIN_PC0 -DSW_BUILTIN=PIN_PC5
tinyAVR012_noloader.menu.54_console_select.22=UART0 TX:PB2 RX:PB3 LED=PC0 SW=PC5 (ATtiny817 Xplained Mini)
tinyAVR012_noloader.menu.54_console_select.23.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.23.build.led_pin=-DLED_BUILTIN=PIN_PC7 -DSW_BUILTIN=PIN_PB5
tinyAVR012_noloader.menu.54_console_select.23=UART0 TX:PB2 RX:PB3 LED=PC7 SW=PB5 (ATtiny817/3217 Xplained Pro)
tinyAVR012_noloader.menu.54_console_select.24.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.24.build.led_pin=-DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6
tinyAVR012_noloader.menu.54_console_select.24=UART0 TX:PB2 RX:PB3 LED=PF5 SW=PF6 (ATtiny1607 Curiosity Nano)
tinyAVR012_noloader.menu.54_console_select.25.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.25.build.led_pin=-DLED_BUILTIN=PIN_PA3 -DSW_BUILTIN=PIN_PB7
tinyAVR012_noloader.menu.54_console_select.25=UART0 TX:PB2 RX:PA3 LED=PA3 SW=PB7 (ATtiny3217 Curiosity Nano)
tinyAVR012_noloader.menu.54_console_select.26.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.26.build.led_pin=-DLED_BUILTIN=PIN_PB7 -DSW_BUILTIN=PIN_PC4
tinyAVR012_noloader.menu.54_console_select.26=UART0 TX:PB2 RX:PB3 LED=PB7 SW=PC4 (ATtiny1627 Curiosity Nano)
tinyAVR012_noloader.menu.90_console_baud.01.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012_noloader.menu.90_console_baud.01=CONSOLE_BAUD=9600 bps (default)
tinyAVR012_noloader.menu.90_console_baud.03.build.console_baud=-DCONSOLE_BAUD=38400
tinyAVR012_noloader.menu.90_console_baud.03=CONSOLE_BAUD=38400 bps
tinyAVR012_noloader.menu.90_console_baud.04.build.console_baud=-DCONSOLE_BAUD=57600
tinyAVR012_noloader.menu.90_console_baud.04=CONSOLE_BAUD=57600 bps
tinyAVR012_noloader.menu.90_console_baud.05.build.console_baud=-DCONSOLE_BAUD=115200
tinyAVR012_noloader.menu.90_console_baud.05=CONSOLE_BAUD=115200 bps
tinyAVR012_noloader.menu.90_console_baud.06.build.console_baud=-DCONSOLE_BAUD=230400
tinyAVR012_noloader.menu.90_console_baud.06=CONSOLE_BAUD=230400 bps
tinyAVR012_noloader.menu.90_console_baud.15.build.console_baud=-DCONSOLE_BAUD=1000000
tinyAVR012_noloader.menu.90_console_baud.15=CONSOLE_BAUD=1000000 bps
tinyAVR012_noloader.menu.90_console_baud.20=-
tinyAVR012_noloader.menu.90_console_baud.21.build.console_baud=-DCONSOLE_BAUD=2400
tinyAVR012_noloader.menu.90_console_baud.21=CONSOLE_BAUD=2400 bps (for ULP)
tinyAVR012_noloader.menu.95_bootloader.01=without Bootloader


